{
    "layout": {
        "en": {
            "menu": [
                "dmytro-khomenko",
                "_hello",
                "_about-me",
                "_projects",
                "_contact-me"
            ]
        },
        "uk": {
            "menu": [
                "дмитро-хоменко",
                "_привіт",
                "_про-мене",
                "_проєкти",
                "_звя'затись"
            ]
        }
    },
    "home": {
        "hiText": {
            "en": "Hi all. I am",
            "uk": "Вітаю. Мене звати"
        },
        "devName": {
            "en": "Dmytro Khomenko",
            "uk": "Дмитро Хоменко"
        },
        "DevProfile": {
            "en": "> Front-end developer",
            "uk": "> Front-end developer"
        },
        "TextDownProfile1": {
            "en": "//this resume is built with react",
            "uk": "//це резюме зроблено на реакті"
        },
        "TextDownProfile2": {
            "en": "//context is used for language switching",
            "uk": "//для зміни мови використовується контекст"
        },
        "TextDownProfileLink": "https://github.com/choodoss"
    },
    "aboutMe": {
        "en": [
            {
                "bio": {
                    "title": "personal-info",
                    "color": "orange",
                    "text": "I am a Frontend Developer with in-depth knowledge and skills in web application development. I recently successfully completed the GoIT courses. I have 16 years of experience in the commercial sector, but I am eager to transition my career to application development, which inspires continuous growth and challenges. I am open to learning and acquiring new knowledge, and I am ready to constantly expand my skills in this field.\n\nI have significant experience in the commercial sector in various positions, including managerial roles. I have successfully managed teams of over 60 employees, led multiple projects, and organized events with varying attendance ranging from 20 to 30,000 individuals. I have worked both independently and collaboratively, allowing me to enhance my project management skills and achieve set goals.\n\nMy determination, motivation, and desire for continuous self-improvement complement my professional persona. I am ready to embrace new challenges and confidently move forward in application development.\n\nPlease note that the translations provided are approximate and may require further refinement based on the specific context and requirements."
                }
            },
            {
                "interests": {
                    "title": "interests",
                    "color": "green",
                    "text": "I am passionate about programming, so I read relevant literature. The last book I read was \"You Don't Know JS: Up & Going\" by Kyle Simpson, which provided me with a deeper understanding of JavaScript.\n\nMy taste in literature is not limited to professional books. As a form of relaxation, I enjoy reading fantasy. One of my favorite books is \"The Name of the Wind\" by Patrick Rothfuss, an exciting story of adventure and magic. Another book that I really enjoyed is \"The Black Company\" by Glen Cook, which depicts a dark world of war and complex relationships.\n\nMusic is not my passion, but when I'm coding, I prefer classical music, and when I'm behind the wheel, I enjoy listening to rock.\n\nI am interested in boxing news, and I also play billiards and chess. Although I must admit that loving to play doesn't necessarily mean playing well."
                }
            },
            {
                "education": {
                    "color": "blue",
                    "window1": [
                        {
                            "school": {
                                "eduIstitut": "School №7",
                                "degree": "basic secondary education",
                                "specialization": "without specialization",
                                "startDate": "1995",
                                "endDate": "2004"
                            }
                        },
                        {
                            "college": {
                                "eduIstitut": "Kyiv College of Communication",
                                "degree": "Vocational education",
                                "specialization": "Telecommunications and Radio Engineering",
                                "startDate": "2004",
                                "endDate": "2008"
                            }
                        },
                        {
                            "academy": {
                                "eduIstitut": "Odessa National Academy of Telecommunications n.a. O.S. Popov",
                                "degree": "Master's degree",
                                "specialization": "Telecommunication systems and networks",
                                "startDate": "2008",
                                "endDate": "2012"
                            }
                        },
                        {
                            "courses": {
                                "eduIstitut": "GoIT",
                                "degree": "Junior",
                                "specialization": "Full Stack Developer",
                                "startDate": "2022",
                                "endDate": "2023"
                            }
                        }
                    ],
                    "window2": [
                        {
                            "TECH SKILLS": [
                                "HTML5/CSS3/SASS",
                                "Responsive/Adaptive design",
                                "git",
                                "JavaScript",
                                "React",
                                "React Nativ",
                                "Redux",
                                "REST API",
                                "Webpack",
                                "Parcel",
                                "Node.js"
                            ]
                        }
                    ]
                }
            },
            {
                "expirians": {
                    "color": "violet",
                    "window1": [
                        {
                            "school": {}
                        },
                        {
                            "college": {}
                        },
                        {
                            "academy": {}
                        },
                        {
                            "courses": {}
                        }
                    ],
                    "window2": [
                        {
                            "TECH SKILLS": [
                                "HTML5/CSS3/SASS",
                                "Responsive/Adaptive design",
                                "git",
                                "JavaScript",
                                "React",
                                "React Nativ",
                                "Redux",
                                "REST API",
                                "Webpack",
                                "Parcel",
                                "Node.js"
                            ]
                        }
                    ]
                }
            }
        ],
        "uk": [
            {
                "про мене": {
                    "title": "Персональна інформація",
                    "text": "Я Frontend Developer з поглибленими знаннями та навичками в розробці веб-додатків, недавно успішно закінчив курси GoIT.\n\nМаю 16-річний досвід в комерційній сфері, але прагну змінити свою кар'єру на розробку додатків, що надихає на постійний розвиток та виклики. Відкритий до навчання та нових знань, готовий постійно розширювати свої навички в цій сфері.\n\nВ комерційній сфері займав різні посади, включаючи керівні. Успішно керував штатом 60+ співробітників, веденням декількох проектів та організацією заходів з різною кількістю відвідувачів, від 20 до 30 000 осіб. Працював як самостійно, так і в команді, що дозволило мені розширити навички в керівництві проектами та досягати поставлених цілей.\n\nЦілеспрямованість, мотивація та бажання постійно розвиватись доповнюють мою професійну особистість.\n\nЯ готовий прийняти нові виклики та впевнено рухатись вперед у розробці додатків. I prefer fantasy literature. The pinnacle of my preferences is Patrick Rothfuss's \"The Name of the Wind.\" However, I also enjoy classic works by Alexandre Dumas, especially \"The Countess of Monsoreau.\" Lately, I have been focusing on professional literature, such as Kyle Simpson's \"You Don't Know JS: Up & Going.\" Movies are my weakness. Horror films scare me, so I prefer movies from various genres, excluding horror. I particularly love science fiction. Whenever possible, I play \"Knack 2\" on PlayStation or other games with my son. I have an interest in chess (not an expert). And finally, I hope to resume regular workouts at the gym, although currently, it's just my future plans."
                }
            },
            {
                "інтереси": {
                    "title": "Інтереси",
                    "text": "З літератури я віддаю перевагу фентезі. Вершиною моїх вподобань є \"Ім'я вітру\" Патріка Ротфуса. Однак, я також насолоджуюся класичними творами Александра Дюма, особливо \"Графинею Демонсоро\". Останнім часом я зосереджуюсь на професійній літературі, як приклад \"You Don't Know JS: Up & Going\" від Кайла Сімпсона.Фільми - моя слабкість. Жахи мене лякають, тому я віддаю перевагу фільмам різних жанрів, за винятком жахів, особливо люблю фантастику. Коли трапляється можливість, граю з сином в \"Knack 2\" на PlayStation або інші ігри, цікавлюсь шахами (не експерт). І, нарешті, я сподіваюся знову розпочати регулярні тренування у спортзалі, хоча наразі це лише мої плани на майбутнє."
                }
            },
            {
                "освіта": {
                    "window1": [
                        {
                            "школа": {
                                "eduIstitut": "ЗОШ №7",
                                "degree": "базова середня освіта",
                                "specialization": "без спеціалізації",
                                "startDate": "1995",
                                "endDate": "2004"
                            }
                        },
                        {
                            "коледж": {
                                "eduIstitut": "Київський коледж зв'язку",
                                "degree": "середня спеціальна освіта",
                                "specialization": "Радіо і телекомунікацій зв'язк",
                                "startDate": "2004",
                                "endDate": "2008"
                            }
                        },
                        {
                            "академія": {
                                "eduIstitut": "Одеська національна академія зв'язку імені О.С. Попова",
                                "degree": "Магістр",
                                "specialization": "Телекомунікаційні системи і мережі",
                                "startDate": "2008",
                                "endDate": "2012"
                            }
                        },
                        {
                            "курси": {
                                "eduIstitut": "GoIT",
                                "degree": "Junior",
                                "specialization": "Full Stack Developer",
                                "startDate": "2022",
                                "endDate": "2023"
                            }
                        }
                    ],
                    "window2": [
                        {
                            "ТЕХНІЧНІ НАВИЧКИ": [
                                "HTML5/CSS3/SASS",
                                "Responsive/Adaptive design",
                                "git",
                                "JavaScript",
                                "React",
                                "React Nativ",
                                "Redux",
                                "REST API",
                                "Webpack",
                                "Parcel",
                                "Node.js"
                            ]
                        }
                    ]
                }
            }
        ]
    }
}