import { TextAbout, Box, TitleAbout } from '../Bio/Bio.styled';

const InterestsAbout = () => {
    return (<>
        <div><TitleAbout>interests</TitleAbout></div>
        <Box>
            <TextAbout>
                Я захоплююся програмуванням, тому читаю відповідну літературу, останню книгу, яку я прочитав, була "You Don't Know JS: Up & Going" авторства Кайла Сімпсона, яка надала мені глибші знання JavaScript.
                Мій смак в літературі не обмежується професійною літературою, у якості відпочинку люблю читати фентезі. Одна з улюблених книг - "The Name of the Wind" Патріка Ротфуса, захоплююча історія про пригоди та магію. Інша книга, що мені дуже сподобалася, - "The Black Company" Глена Кука, яка представляє темний світ війни та складні відносини.
                Музика не є моєю пристрастю, коли пишу код віддаю перевагу класиці, а за кермом року.
                Цікавлюсь новинами боксу, граю в більярд і шахи, хоча маю визнати, що любити грати не означає грати добре
            </TextAbout>
        </Box >
    </>)
};

export default InterestsAbout;