{
    "items": [
        [
            {
                "title": "ERC Distribution",
                "position": "Head of the Development and Content Department",
                "dateTime": "June 2023 - until now",
                "workTime": "Full-time"
            },
            {
                "title": "description",
                "description": "Implementation of the content and technological initiatives development strategy in line with the company's mission. Leadership of the content professionals team: providing guidance, motivation, and support to achieve high-performance results. Creation of high-quality and captivating content for the company's website and other digital channels. Ensuring content quality control. Analysis and improvement of content production processes to optimize workflows and enhance outcomes. Collaboration with other company departments to achieve strategic and operational objectives. Adherence to budgets and timelines for effective resource management."
            }
        ],
        [
            {
                "title": "ERC Distribution",
                "position": "Director of Graphic Content Division",
                "dateTime": "March 2021 - until now",
                "workTime": "Full-time"
            },
            {
                "title": "description",
                "description": "Development and Execution of Content Strategy in line with the Company's Mission. Leadership of the Content Professionals Team. Creation of High-Quality and Engaging Content. Quality Control and Content Optimization. Analysis and Improvement of Content Production Processes. Collaboration with Other Departments to Achieve Objectives. Adherence to Budgets and Timelines."
            }
        ],
        [
            {
                "title": "ERC Distribution",
                "position": "Project Manager",
                "dateTime": "July 2015 - March 2021",
                "workTime": "Full-time"
            },
            {
                "title": "description",
                "description": "Planning and selecting topics for articles, photographic materials, etc. Choosing visual elements, photographs, and illustrations for use. Interaction with authors and ensuring timely submission of materials. Collaboration with designers to create attractive layouts. Monitoring the printing and distribution of the publication. Coordinating the project team's work and involving relevant experts. Ensuring communication and coordination between the editorial team, designers, and other stakeholders. Duties related to participating in exhibition organization: Ensuring timely submission of all necessary materials from participants. Developing and coordinating the visualization of exhibition stands. Planning the event's network and engaging appropriate specialists for implementation. Providing necessary equipment, furniture, and materials. Attracting participants to the exhibition. Participating in the planning of entertainment activities. Providing informational support for the exhibition program. Resolving ongoing issues and supporting participants and visitors."
            }
        ],
        [
            {
                "title": "ERC Distribution",
                "position": "Director of Training Centre",
                "dateTime": "Mar 2012 - Jul 2015",
                "workTime": "Full-time"
            },
            {
                "title": "description",
                "description": "Team Leadership and Motivation. Planning and Organization of Events (Seminars, Workshops, Lectures). Establishing Effective Communication with Clients to Gather Requirements and Feedback. Monitoring Financial Activities, Budgeting, and Reporting. Resource Utilization Optimization and Cost Efficiency. Ensuring Adherence to High Standards of Event Organization and Service Quality."
            }
        ],
        [
            {
                "title": "ERC Distribution",
                "position": "Promoter",
                "dateTime": "July 2007 - October 2008",
                "workTime": "Half-time"
            },
            {
                "title": "description",
                "description": "Main responsibilities included selling technical products.Effectively presenting the products and familiarizing customers with their features and benefits. With my energy and expert knowledge of the products, I can communicate persuasively with customers, finding optimal solutions for their needs. My results were consistently high. Actively promoted the products, using persuasive arguments and a personalized approach for each customer. This led to achieving stable, excellent sales results throughout my entire tenure."
            }
        ]
    ]
}